RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
// RSLK
#include "msp.h"
#include <stdint.h>
#include <string.h>
#include <stdbool.h>
#include "..\inc\UART0.h"
#include "..\inc\EUSCIA0.h"
#include "..\inc\FIFO0.h"
#include "..\inc\Clock.h"
//#include "..\inc\SysTick.h"
#include "..\inc\SysTickInts.h"
#include "..\inc\CortexM.h"
#include "..\inc\TimerA1.h"
//#include "..\inc\Bump.h"
#include "..\inc\BumpInt.h"
#include "..\inc\LaunchPad.h"
#include "..\inc\Motor.h"
#include "../inc/IRDistance.h"
#include "../inc/ADC14.h"
#include "../inc/LPF.h"
#include "..\inc\Reflectance.h"
#include "../inc/TA3InputCapture.h"
#include "../inc/Tachometer.h"

#define P2_4 (*((volatile uint8_t *)(0x42098070)))
#define P2_3 (*((volatile uint8_t *)(0x4209806C)))
#define P2_2 (*((volatile uint8_t *)(0x42098068)))
#define P2_1 (*((volatile uint8_t *)(0x42098064)))
#define P2_0 (*((volatile uint8_t *)(0x42098060)))

void AppMotorTest(void);
void AppIRTest(void);
void AppBumperTest(void);
void AppRefTest(void);
void AppTachTest(void);
void AppAdvBumpTest(void);
void AppLineFollowerTest(void);

//#define DEBUG

/********* APP UTIL ***********/
const char* conv_int2byte(uint8_t x)
{
    static char b[9];
    b[0] = '\0';

    uint8_t z;
    for (z = 128; z > 0; z >>= 1)
    {
        strcat(b, ((x & z) == z) ? "1" : "0");
    }

    return b;
}


static void fsm_led(uint8_t v)
{
    LaunchPad_Output((v == 0) << 1 | (v == 1) << 0 | (v == 2) << 2);
}

typedef enum
{
    SEND, REPLACE
} eUART_SEND;

static void AppUARTSend(char* str, eUART_SEND t)
{
    if (t == REPLACE)
        UART0_OutString("\033[A\33[2K\r");
    UART0_OutString(str);
    EUSCIA0_OutChar(CR);
    EUSCIA0_OutChar(LF);
}

/*****************************/
// =============================================================================
// LED Helper Functions for Visual Feedback
// Uses LaunchPad RGB LED: P2.0=Red, P2.1=Green, P2.2=Blue
// =============================================================================

// Turn off all LEDs
static void LED_Off(void) {
    LaunchPad_Output(0); // 0b000 = all off
}

// Set LED to a specific color (use with COLOR_ constants below)
static void LED_SetColor(uint8_t color) {
    LaunchPad_Output(color);
}

/*
Predefined color constants (match LaunchPad hardware):
- COLOR_OFF: 0x00 (0b000) - All colors off
- COLOR_RED: 0x01 (0b001) - Red (P2.0)
- COLOR_GREEN: 0x02 (0b010) - Green (P2.1)
- COLOR_YELLOW: 0x03 (0b011) - Red + Green
- COLOR_BLUE: 0x04 (0b100) - Blue (P2.2)
- COLOR_PURPLE: 0x05 (0b101) - Red + Blue
- COLOR_CYAN: 0x06 (0b110) - Green + Blue
- COLOR_WHITE: 0x07 (0b111) - All colors on
*/


/*****************************/

/* [7] FSM */

typedef enum
{
    STATE_OK = 0,
    STATE_L,
    STATE_R,
    STATE_ERR = -1
} eStateFsm;
typedef struct
{
    eStateFsm state;
    uint32_t iterations;
    void(*fp_led)(uint8_t);

} fsm_t;
static void _proc_fsm(fsm_t* fsm, int32_t sig);
static const uint32_t STATE_PERSIST_DUR_MS = 25;
static uint32_t MOTOR_SPEED = 1200;

/***********/


void RSLK_Reset(void)
{
    DisableInterrupts();

    LaunchPad_Init();

    EnableInterrupts();
}

void TimedPause(uint32_t time)
{
    Clock_Delay1ms(time);          // run for a while and stop
    Motor_Stop();
}

// variables for ir sensors
volatile uint32_t ADCvalue;
volatile uint32_t ADCflag;
volatile uint32_t nr, nc, nl;


// variables for bumper
static volatile uint8_t bumpIntData, isCollided;
void handlerGpio4Bump(uint8_t v)
{
    Motor_Stop();
    bumpIntData = v;
    isCollided = 1;
    P4->IFG &= ~0xED; // clear interrupt flags

}
uint8_t bump_data;
bool bump[6] = { 0 };
char bumperBuf[30];


void handlerAdcRead(void)
{  // runs at 2000 Hz
    uint32_t raw17, raw12, raw16;
    P1OUT ^= 0x01;         // profile
    P1OUT ^= 0x01;         // profile
    ADC_In17_12_16(&raw17, &raw12, &raw16);  // sample
    nr = LPF_Calc(raw17);  // right is channel 17 P9.0
    nc = LPF_Calc2(raw12);  // center is channel 12, P4.1
    nl = LPF_Calc3(raw16);  // left is channel 16, P9.1
    ADCflag = 1;           // semaphore
    P1OUT ^= 0x01;         // profile
}





// tachometer variables
uint16_t Period0;              // (1/SMCLK) units = 83.3 ns units
uint16_t First0 = 0;             // Timer A3 first edge, P10.4
uint32_t Done0 = 0;              // set each rising

uint16_t Period2;              // (1/SMCLK) units = 83.3 ns units
uint16_t First2 = 0;             // Timer A3 first edge, P8.2
uint32_t Done2 = 0;              // set each rising
uint32_t LeftRPM = 0, RightRPM = 0;

// max period is (2^16-1)*83.3 ns = 5.4612 ms
// min period determined by time to run ISR, which is about 1 us
void PeriodMeasure0(uint16_t time)
{
    Period0 = (time - First0) & 0xFFFF; // 16 bits, 83.3 ns resolution
    First0 = time;                    // setup for next
    Done0++;
}

// max period is (2^16-1)*83.3 ns = 5.4612 ms
// min period determined by time to run ISR, which is about 1 us
void PeriodMeasure2(uint16_t time)
{
    Period2 = (time - First2) & 0xFFFF; // 16 bits, 83.3 ns resolution
    First2 = time;                    // setup for next
    Done2++;
}



// RSLK Self-Test
// Sample program of how the text based menu can be designed.
// Only one entry (RSLK_Reset) is coded in the switch case. Fill up with other menu entries required for Lab5 assessment.
// Init function to various peripherals are commented off.  For reference only. Not the complete list.

int main(void)
{
    uint32_t cmd = 0xDEAD, menu = 0;

    DisableInterrupts();
    Clock_Init48MHz();  // makes SMCLK=12 MHz
    //SysTick_Init(48000,2);  // set up SysTick for 1000 Hz interrupts
    Motor_Init();
    //Motor_Stop();
    LaunchPad_Init();
    BumpInt_Init(&handlerGpio4Bump);
    //Bumper_Init();
    //IRSensor_Init();
    //Tachometer_Init();
    EUSCIA0_Init();     // initialize UART
    EnableInterrupts();

    while (1)
    {                     // Loop forever
        // write this as part of Lab 5
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("RSLK Self-Test (Basic + Adv) UI");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[0] RSLK Reset");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[1] Motor Test");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[2] IR Sensor Test");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[3] Bumper Test");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[4] Reflectance Sensor Test");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[5] Tachometer Test");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[6] All Bump Switches Detection");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[7] FSM Line follower test not working");
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[8] Turn Left 90 degrees");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[9] Turn 90 Left when black line detected");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[10] Turn Right 90 degrees");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[11] Turn 90 Right when black line detected");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[12] Line Following");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[13] Obstacle Avoidance");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[14] Bump Binary Converter");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[15] Switch Control LED Demo");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[16] Bumper Recovery Mode to Turn Robot Away from Obstacle");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[17] IR distance Led detection with LED");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[18] Forward with Safety Stop");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[19] Sequenced Wall Follow");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[20] Cup Navigation not working");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[21] LF case 1 need to check");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[22] LF case 2 need to check ");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString("[23] bump sensor counter");
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);

        EUSCIA0_OutString("CMD: ");
        cmd = EUSCIA0_InUDec();
        EUSCIA0_OutChar(CR);
        EUSCIA0_OutChar(LF);
        isCollided = 0;
        // \033[A\33[2K\r VT100 code to clear prev line
        switch (cmd)
        {
        case 0:
            RSLK_Reset();
            menu = 1;
            cmd = 0xDEAD;
            AppUARTSend("SYSTEM RESET", SEND);
            break;

        case 1:
            // Motor Test
            AppUARTSend("STARTING MOTOR TEST", SEND);
            AppMotorTest();
            AppUARTSend("MOTOR TEST DONE. Returning.", SEND);
            break;

