RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
        case 2:
            // IR Sensor test
            AppUARTSend("STARTING IR SENSOR TEST", SEND);
            AppIRTest();
            AppUARTSend("IR SENSOR TEST DONE. Returning.", SEND);
            break;

        case 3:
            // Bumpers
            AppUARTSend("STARTING BUMPER TEST", SEND);
            AppBumperTest();
            AppUARTSend("BUMPER TEST DONE. Returning.", SEND);

            break;

        case 4:
            // reflectance
            AppUARTSend("STARTING REFLECTANCE SENSOR TEST", SEND);
            AppRefTest();
            AppUARTSend("REFLECTANCE SENSOR TEST DONE. Returning.", SEND);
            break;

        case 5:

            // Tachometer test
            AppUARTSend("STARTING TACHOMETER SENSOR TEST", SEND);

            AppTachTest();
            AppUARTSend("TACHOMETER SENSOR TEST DONE. Returning.", SEND);
            break;

        case 6:
            // Bumpers

            AppUARTSend(" Simultaneous bump switches detection", SEND);
            AppUARTSend(" ", SEND);
            AppAdvBumpTest();

            AppUARTSend(
                "Simultaneous bump switches detection TEST DONE. Returning.",
                SEND);
            break;
        case 7:
            // Bumpers

            AppUARTSend("Line follower test FSM ", SEND);
            AppUARTSend(" ", SEND);
            AppLineFollowerTest();

            AppUARTSend(
                "Line follower TEST DONE. Returning.",
                SEND);
            break;
        case 8:
            AppUARTSend("Starting LEFT 90 turn", SEND);
            AppTurnLeft90();
            AppUARTSend("Turned Left done", SEND);
            break;
        case 9:
            AppUARTSend("Starting BLACK LINE TURN 90 LEFT test", SEND);
            AppTurnLeftOnBlackLine();
            AppUARTSend("BLACK LINE TURN 90 left test done. Returning.", SEND);
            break;
        case 10:
            AppUARTSend("Starting RIGHT 90 turn", SEND);
            AppTurnRight90();
            AppUARTSend("Turned Right done.", SEND);
            break;
        case 11:
            AppUARTSend("Starting BLACK LINE TURN 90 RIGHT test", SEND);
            AppTurnRightOnBlackLine();
            AppUARTSend("BLACK LINE TURN 90 Right test done. Returning.", SEND);
            break;
        case 12:
            AppUARTSend("Starting LINE FOLLOWING test", SEND);
            Line_Following();
            AppUARTSend("LINE FOLLOWING test done. Returning.", SEND);
            break;
        case 13:
            AppUARTSend("Starting OBSTACLE AVOIDANCE", SEND);
            Obstacle_Avoidance();
            AppUARTSend("OBSTACLE AVOIDANCE DONE. Returning.", SEND);
            break;
        case 14:
            AppUARTSend("Starting Bump Binary Converter", SEND);
            AppBumpBinaryConverter();
            AppUARTSend("Bump Binary Converter DONE. Returning.", SEND);
            break;
        case 15:
             AppUARTSend("Starting Switch Control Demo", SEND);
             AppSwitchControlLED();
             AppUARTSend("Switch Control Demo finished", SEND);
             break;
        case 16:
            AppUARTSend("Starting Bumper Recovery Mode", SEND);
            AppBumper_Recovery();
            AppUARTSend("Bumper Recovery finished", SEND);
            break;
        case 17:
            AppUARTSend("Starting IR distance LED detection", SEND);
            AppIR_Distance_Warning();
            AppUARTSend("IR distance Led detection DONE. Returning. ", SEND);
            break;
        case 18:
            AppUARTSend("Starting Sequenced Wall Follow", SEND);
            AppForward_With_Safety_Stop();
            AppUARTSend("Sequenced Wall Follow DONE. Returning. ", SEND);
            break;
        case 19:
            AppUARTSend("Starting Sequenced Wall Follow", SEND);
            AppSequenced_Wall_Follow();
            AppUARTSend("Sequenced Wall Follow DONE. Returning. ", SEND);
            break;
        case 20:
            AppUARTSend("Starting Cup Navigation", SEND);
            AppCupNavigation();
            AppUARTSend("Cup Navigation DONE. Returning.", SEND);
            break;
        case 21:
            AppUARTSend("Line following with switch cases to input stuff", SEND);
            AppAdvancedLineFollowing();
            AppUARTSend("End the thing DONE. Returning.", SEND);
            break;
        case 22:
            AppUARTSend("customize line following with scenarios not sure if working", SEND);
            Flexible_Line_Following();
            AppUARTSend("End the thing DONE. Returning.", SEND);
            break;
        case 23:
            AppUARTSend("BUmp sensor count", SEND);
            Bump_Sensor_Counter();
            AppUARTSend("End the thing DONE. Returning.", SEND);
            break;

            menu = 1;
            break;
        }

        if (!menu)
            Clock_Delay1ms(1000);

        else
        {
            menu = 0;
        }

    }
}

/*
 * This function uses timer PWM to control the motor speed.
 * It stops when all tests are complete.
 */
void AppMotorTest(void)
{
    AppUARTSend("DIRECTION: FORWARD", REPLACE);
    Motor_Forward(3000, 3000);
    TimedPause(2000);
    AppUARTSend("DIRECTION: BACKWARD", REPLACE);
    Motor_Backward(3000, 3000);
    TimedPause(2000);
    AppUARTSend("DIRECTION: RIGHT", REPLACE);
    Motor_Right(3000, 3000);
    TimedPause(2000);
    AppUARTSend("DIRECTION: LEFT", REPLACE);
    Motor_Left(3000, 3000);
    TimedPause(2000);
    AppUARTSend("RIGHT MOTOR ONLY", REPLACE);
    Motor_Forward(3000, 0);
    TimedPause(2000);
    AppUARTSend("LEFT MOTOR ONLY", REPLACE);
    Motor_Forward(0, 3000);
    TimedPause(2000);
    Motor_Stop();
}

/*
 * This function initializes ADC, runs a single sample to initialize lpf ringbuf,
 * then init timer a1 with fp to handlerAdcRead() to be called at 2000Hz. this will acquire
 * the raw ADC values and set the flag high.
 * the spinloop in the program will monitor the adc flag and print the values if it is set,
 * and exit the program if bumpswitch collision flag is set.
 */
void AppIRTest(void)
{
    isCollided = 0;

