RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
    char buf[100];
    uint32_t raw17, raw12, raw16;
    uint32_t s, n;

    ADCflag = 0;
    s = 256; // replace with your choice

    ADC0_InitSWTriggerCh17_12_16();   // initialize channels 17,12,16

    ADC_In17_12_16(&raw17, &raw12, &raw16);  // sample

    LPF_Init(raw17, s);     // P9.0/channel 17
    LPF_Init2(raw12, s);     // P4.1/channel 12
    LPF_Init3(raw16, s);     // P9.1/channel 16

    //UART0_Init();          // initialize UART0 115,200 baud rate

    TimerA1_Init(&handlerAdcRead, 250);    // 2000 Hz sampling
    EnableInterrupts();

    while (1)
    {
        for (n = 0; n < 250; n++)
        {
            while (ADCflag == 0)
                ;
            ADCflag = 0; // show every nth point
        }
        if (isCollided)
        {

            isCollided = 0;
            return;
        }
        sprintf(buf, "%5dcm,%5dcm,%5dcm", LeftConvert(nl), CenterConvert(nc),
            RightConvert(nr));
        AppUARTSend(buf, REPLACE);
    }

}

/*
 * This function uses reads the status of the bump switches from Bump_Read()
 * on demand. this function is also asynchronously called by the gpio4handler.
 * It exits when all bump switches have been pressed.
 */
void AppBumperTest(void)
{
    isCollided = 0;

    while (!bump[0] || !bump[1] || !bump[2] || !bump[3] || !bump[4] || !bump[5])
    {
        bump_data = Bump_Read();

        for (uint8_t i = 0; i < 6; i++)
        {
            if ((((bump_data >> i & 0xF) & 0x1)) == 0 && bump[i] == 0)
            {
                bump[i] = true;
                char buf[30];
                snprintf(buf, 30, "BUMPER %d PRESSED", i);
                AppUARTSend(buf, REPLACE);

            }
        }
    }
    for (uint8_t i = 0; i < 6; i++)  bump[i] = false; // rst state

}

/*
 * This function reads from the reflectance sensors and prints out their value
 * It exits when isCollided is set from gpio4 interrupt.
 */
void AppRefTest(void)
{
    isCollided = 0;

    uint8_t Data; // QTR-8RC
    int32_t Position; // 332 is right, and -332 is left of center

    char refBuf[20] = "";

    while (1)
    {

        if (isCollided)
        {

            isCollided = 0;
            LaunchPad_Output(0); // turn off leds
            break;
        }
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);

        // >>>>>>>>>> ADD THESE TWO LINES FOR LED FEEDBACK <<<<<<<<<<
                if (Data != 0x00)
                    LaunchPad_Output(0x02); // GREEN (P2.1)
                else
                    LaunchPad_Output(0x01); // RED (P2.0)
                // >>>>>>>>>> END OF ADDITION <<<<<<<<<<

        sprintf(refBuf, "%s, %d mm", conv_int2byte(Data), Position / 10);
        AppUARTSend(refBuf, REPLACE);


        Clock_Delay1ms(100);

    }
}

/*
 * This function init timer a3 in capture mode, starts motor, places the cpu in WFI, prints tachometer
 * info for each 100 exits from WFI, and exits if collided.
 */
void AppTachTest(void)
{
    isCollided = 0;
    EnableInterrupts();
    uint32_t count = 0;
    char buf[100];
    TimerA3Capture_Init(&PeriodMeasure0, &PeriodMeasure2);
    TimedPause(500);
    Motor_Forward(1500, 1500);
    EnableInterrupts();
    while (1)
    {
        //WaitForInterrupt();
        __WFI();
        count++;
        if (count % 100 == 0)
        {
            memset(buf, 0, sizeof(buf));
            // (pulse per rot * pulse dur * interval between pulse / 1k) = time taken for 1 rot in ms
            // ms in a minute / ^ = RPM
            LeftRPM = ((60 * 1000 * 1000) / (360 * 83.3 * Period0 / 1000));
            RightRPM = ((60 * 1000 * 1000) / (360 * 83.3 * Period2 / 1000));

            sprintf(buf, "Right RPM = %2d, Left RPM = %2d, Right count = %2d, Left count = %2d", RightRPM, LeftRPM, Period2, Period0);

            AppUARTSend(buf, REPLACE);
            count = 0;
        }
        if (isCollided)
        {

            isCollided = 0;
            return;
        }
    }
}

/*
 * This function also tests bump switches but allows for multiple simultaneous presses.
 * Exits when all are pressed
 */
void AppAdvBumpTest(void)
{
    while (1)
    {

        int pressed = 0;
        strcpy(bumperBuf, "Pressed on switches: ");
        bump_data = Bump_Read();
        if ((((bump_data >> 0) & 0x1)) == 0)
        {
            strcat(bumperBuf, "0 ");
            pressed = 1;
        }
        if ((((bump_data >> 1) & 0x1)) == 0)
        {
            strcat(bumperBuf, "1 ");
            pressed = 1;
        }
        if ((((bump_data >> 2) & 0x1)) == 0)
        {
            strcat(bumperBuf, "2 ");
            pressed = 1;
        }
        if ((((bump_data >> 3) & 0x1)) == 0)
        {
            strcat(bumperBuf, "3 ");
            pressed = 1;
        }
        if ((((bump_data >> 4) & 0x1)) == 0)
        {
            strcat(bumperBuf, "4 ");
            pressed = 1;
        }
        if ((((bump_data >> 5) & 0x1)) == 0)
        {
            strcat(bumperBuf, "5 ");
            pressed = 1;
        }

        if (!pressed)
        {
            AppUARTSend("Waiting for press", REPLACE);
        }
        else
            AppUARTSend(bumperBuf, REPLACE);

        if ((bump_data & 0b111111) == 0)
        {

            return;
        }

        Clock_Delay1ms(100);

    }
}



void AppTurnLeft90(void) {
    AppUARTSend("TURNING LEFT 90", SEND);
    Motor_Left(3000, 3000);
    Clock_Delay1ms(250); // Calibrate this delay for your RSLK
    Motor_Stop();
    AppUARTSend("TURN LEFT COMPLETE", REPLACE);
}

void AppTurnRight90(void) {
    AppUARTSend("TURNING Right 90", SEND);
    Motor_Right(3000, 3000);
    Clock_Delay1ms(750); // Calibrate this delay for your RSLK
    Motor_Stop();
    AppUARTSend("TURN RIGHT COMPLETE", REPLACE);
}

void AppTurnLeftOnBlackLine(void) {
    AppUARTSend("Move forward until black line detected", SEND);
    uint8_t Data;
    int32_t Position;

    Motor_Forward(1500, 1500); // start moving forward
    Clock_Delay1ms(100);

    while (1) {
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);

