RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
        if (Data != 0) { // black line detected
            Motor_Stop();
            AppUARTSend("Black line detected!", SEND);
            break;
        }
    }

    // Now perform a 90 turn to the left
    AppUARTSend("Turning LEFT 90", SEND);
    AppTurnLeft90();


   // Clock_Delay1ms(750); // adjust this for your actual 90 turn
    Motor_Stop();

    AppUARTSend("Turn complete", REPLACE);
}


void AppTurnRightOnBlackLine(void) {
    AppUARTSend("Move forward until black line detected", SEND);
    uint8_t Data;
    int32_t Position;

    Motor_Forward(1500, 1500); // start moving forward
    Clock_Delay1ms(100);

    while (1) {
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);

        if (Data != 0) { // black line detected
            Motor_Stop();
            AppUARTSend("Black line detected!", SEND);
            break;
        }
    }

    // Now perform a 90 turn to the left
    AppUARTSend("Turning LEFT 90", SEND);
    AppTurnRight90();


 //   Clock_Delay1ms(750); // adjust this for your actual 90 turn
    Motor_Stop();

    AppUARTSend("Turn complete", REPLACE);
}


// My Line following implementation
void Line_Following(void) {
    uint8_t data = 0;
    uint8_t temp = 0;
    int Position, lastPosition = 0;

    AppUARTSend("Starting Line Following...", SEND);



    while (1) {
        // Read reflectance sensors
        data = Reflectance_Read(2000);
        temp = data;
        int Position = Reflectance_Position(data);

        // Debug print
        for (int i = 0; i < 8; i++) {
            EUSCIA0_OutUDec(data % 2);
            EUSCIA0_OutString("-");
            data /= 2;
        }
        EUSCIA0_OutChar(CR); EUSCIA0_OutChar(LF);


        // Line following control
        if (Position >= -47 && Position <= 47) {
            Motor_Forward(2000, 2000);
        }
        else if (Position > 47 && Position <= 238) {
            Motor_Forward(750, 3000);
        }
        else if (Position < -47 && Position >= -238) {
            Motor_Forward(3000, 750);
        }
        else if (Position > 238 && Position <= 334) {
            Motor_Right(2000, 2000);
        }
        else if (Position < -238 && Position >= -334) {
            Motor_Left(2000, 2000);
        }
        else if (Position > 334 || Position < -334) {
            // Instead of stopping immediately, try recovery
                       EUSCIA0_OutString("Off-line detected. Attempting recovery...\r\n");
                       if (Position > 0) {
                           Motor_Right(2000, 2000);
                       } else {
                           Motor_Left(2000, 2000);
                       }
                       Clock_Delay1ms(150);
                       continue;

        }

        // Parking condition
        if (temp == 0xFF) {
            EUSCIA0_OutString("PARKING\r\n");
            Motor_Stop();
            break;
        }

        Clock_Delay1ms(50); // small delay to prevent overload
    }

    EUSCIA0_OutString("LINE FOLLOWING DONE\r\n");
}

// Obstacle avoidance implementation
void Obstacle_Avoidance(void) {
    AppUARTSend("Starting OBSTACLE AVOIDANCE", SEND);
    isCollided = 0;

    uint32_t raw17,raw12,raw16;
           int32_t n; uint32_t s;
           ADCflag = 0;
           s = 256; // replace with your choice
           ADC0_InitSWTriggerCh17_12_16();   // initialize channels 17,12,16
           ADC_In17_12_16(&raw17,&raw12,&raw16);  // sample
           LPF_Init(raw17,s);     // P9.0/channel 17
           LPF_Init2(raw12,s);     // P4.1/channel 12
           LPF_Init3(raw16,s);     // P9.1/channel 16
             //UART0_Init();          // initialize UART0 115,200 baud rate
            LaunchPad_Init();
           TimerA1_Init(&handlerAdcRead, 250);    // 2000 Hz sampling
           //UART0_OutString("GP2Y0A21YK0F test\nValvano Oct 2017\nConnect analog signals to P9.0,P4.1,P9.1\n");
           //EnableInterrupts();
           //int32_t c = CenterConvert(nc);

           isCollided = 0;
           while(!isCollided){
             for(n=0; n<2000; n++){
               while(ADCflag == 0){};
               ADCflag = 0; // show every 2000th point
             }

             UART0_OutUDec5(CenterConvert(nc));UART0_OutString(" mm\r\n");


             if (CenterConvert(nc) < 150) {  // obstacle ahead
                         AppUARTSend("Obstacle detected! Turning right", REPLACE);
                         Motor_Stop();
                        // Clock_Delay1ms(700);

                         // Detour
                         Motor_Right(3000, 3000);
                         Clock_Delay1ms(750);  // ~90� right turn
                         Motor_Forward(2000, 2000);
                         Clock_Delay1ms(1500);

                         // Resume
                         AppUARTSend("Resuming path", REPLACE);
                         Motor_Left(3000, 3000);
                         Clock_Delay1ms(750);  // return to original direction
                     }
                     else {
                         Motor_Forward(1500, 1500);
                     }

                     if (isCollided) break;
                     Clock_Delay1ms(50);
 }

    Motor_Stop();
    AppUARTSend("OBSTACLE AVOIDANCE COMPLETE", SEND);
}



//  Binary, Decimal, Hex converter for bump switches
void AppBumpBinaryConverter(void) {
    AppUARTSend("Press any bump switches to see Binary, Decimal, Hex", SEND);

    uint8_t prevData = 0xFF;
    while (1) {
        uint8_t data = Bump_Read();   // active-low
        data = (~data) & 0x3F;        // mask to 6 bits

        if (data != prevData) {
            prevData = data;

            uint32_t decimal = 0;
            for (int i = 0; i < 6; i++)
                if (data & (1 << i))
                    decimal += (1 << i);

            // manual hex conversion
            char hex[3];
            uint8_t hi = (decimal >> 4) & 0xF;
            uint8_t lo = decimal & 0xF;
            hex[0] = (hi < 10) ? ('0' + hi) : ('A' + hi - 10);
            hex[1] = (lo < 10) ? ('0' + lo) : ('A' + lo - 10);
            hex[2] = '\0';

            char buf[80];
            sprintf(buf, "Binary: %s | Decimal: %u | Hex: 0x%s", conv_int2byte(data), decimal, hex);
            AppUARTSend(buf, REPLACE);
        }
        Clock_Delay1ms(100);
    }
}

void AppSwitchControlLED(void)
{
    AppUARTSend("Switch Control Demo: Connect switches to P1.1 and P1.4", SEND);
    AppUARTSend("Press any bumper to exit", SEND);


    P1->DIR &= ~0x12;
    P1->REN |= 0x12;
    P1->OUT |= 0x12;


    isCollided = 0;
    while (!isCollided) {

        uint8_t sw1_pressed = (P1->IN & 0x02) == 0;
        uint8_t sw2_pressed = (P1->IN & 0x10) == 0;


        if (sw1_pressed && sw2_pressed) {

            Motor_Forward(2500, 2500);
            LaunchPad_Output(0x01); // red
        }
        else if (sw1_pressed && !sw2_pressed) {

            Motor_Left(2500, 2500);

            LaunchPad_Output(0x02); // green
        }
        else if (!sw1_pressed && sw2_pressed) {

            Motor_Right(2500, 2500);
            LaunchPad_Output(0x04); // blue
        }
        else {

            Motor_Stop();
            LED_Off();
        }

        Clock_Delay1ms(100);
    }


    Motor_Stop();
    LED_Off();

