RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
}


// AppBumper_Recovery
// Robot drives forward until a bumper is pressed, then executes a recovery maneuver.


void AppBumper_Recovery(void)
{
    AppUARTSend("Bumper Recovery Mode: Driving forward until collision", SEND);
    AppUARTSend("After hit: 90-degree left turn + short move + stop", SEND);

    // Ensure we start fresh
    isCollided = 0;
    Motor_Stop();
    Clock_Delay1ms(200);

    // Drive forward until bumper is hit
    Motor_Forward(2000, 2000);
    LaunchPad_Output(0x02); // green

    while (!isCollided) {
        Clock_Delay1ms(10);
    }

    // --- Collision detected! ---
    AppUARTSend("Bumper pressed! Executing recovery...", SEND);
    LaunchPad_Output(0x01);

    // Stop motors
    Motor_Stop();
    Clock_Delay1ms(200);


    // === RECOVERY MANEUVER ===
        // Option 1: 90-degree LEFT turn
    const uint32_t TURN_DELAY_MS = 750;

    // Option 2: 180-degree turn (uncomment below if preferred)
    // const uint32_t TURN_DELAY_MS = 1500;

    Motor_Left(3000, 3000);
    Clock_Delay1ms(TURN_DELAY_MS);

    // Move forward to clear obstacle
    Motor_Forward(2500, 2500);
    Clock_Delay1ms(1000);

    // Final stop
    Motor_Stop();
    LED_Off();

    AppUARTSend("Recovery complete. Robot stopped.", SEND);
}

// AppLED_IR_Distance_Indicator
// Uses center IR sensor to indicate proximity via LED color.
// - RED:    < 10 cm (very close)
// - cyan: 10�20 cm
// - purple:  20�30 cm
// - BLUE:   > 30 cm (far)
void AppIR_Distance_Warning(void)
{
    AppUARTSend("IR Distance LED Indicator (center sensor)", SEND);
    uint32_t raw17,raw12,raw16;
          int32_t n; uint32_t s;
          ADCflag = 0;
          s = 256; // replace with your choice
          ADC0_InitSWTriggerCh17_12_16();   // initialize channels 17,12,16
          ADC_In17_12_16(&raw17,&raw12,&raw16);  // sample
          LPF_Init(raw17,s);     // P9.0/channel 17
          LPF_Init2(raw12,s);     // P4.1/channel 12
          LPF_Init3(raw16,s);     // P9.1/channel 16
            //UART0_Init();          // initialize UART0 115,200 baud rate
           LaunchPad_Init();
          TimerA1_Init(&handlerAdcRead, 250);    // 2000 Hz sampling
          //UART0_OutString("GP2Y0A21YK0F test\nValvano Oct 2017\nConnect analog signals to P9.0,P4.1,P9.1\n");
          //EnableInterrupts();
          //int32_t c = CenterConvert(nc);

          isCollided = 0;
          while(!isCollided){
            for(n=0; n<2000; n++){
              while(ADCflag == 0){};
              ADCflag = 0; // show every 2000th point
            }

            UART0_OutUDec5(CenterConvert(nc));UART0_OutString(" mm\r\n");

            if ( CenterConvert(nc) < 100 ){
                // Blink LED or something
                LaunchPad_Output(0x01);       // Red
                Clock_Delay1ms(100);
            } else if(CenterConvert(nc) < 200){
                LaunchPad_Output(0x06);       // cyan
                Clock_Delay1ms(100);
            }else if(CenterConvert(nc) < 300){
                LaunchPad_Output(0x05);       // purple
                Clock_Delay1ms(100);
            }else {
                LaunchPad_Output(0x04);       // cyan
                Clock_Delay1ms(100);
            }
}
          AppUARTSend("IR LED Indicator stopped (bumper pressed)", SEND);
}

void AppForward_With_Safety_Stop(void)
{
  //  while(LaunchPad_Input()==0);  // wait for touch
    //while(LaunchPad_Input());     // wait for release
   // TimedPause(1000);

    // IR init /////////////////////////////////////////


          uint32_t raw17,raw12,raw16;
          int32_t n; uint32_t s;
          ADCflag = 0;
          s = 256; // replace with your choice
          ADC0_InitSWTriggerCh17_12_16();   // initialize channels 17,12,16
          ADC_In17_12_16(&raw17,&raw12,&raw16);  // sample
          LPF_Init(raw17,s);     // P9.0/channel 17
          LPF_Init2(raw12,s);     // P4.1/channel 12
          LPF_Init3(raw16,s);     // P9.1/channel 16
            //UART0_Init();          // initialize UART0 115,200 baud rate
           LaunchPad_Init();
          TimerA1_Init(&handlerAdcRead, 250);    // 2000 Hz sampling
          //UART0_OutString("GP2Y0A21YK0F test\nValvano Oct 2017\nConnect analog signals to P9.0,P4.1,P9.1\n");
          //EnableInterrupts();
          while(1){
            for(n=0; n<2000; n++){
              while(ADCflag == 0){};
              ADCflag = 0; // show every 2000th point
            }

            Motor_Forward(1000,1000);
            TimedPause(1000);

            UART0_OutUDec5(CenterConvert(nc));UART0_OutString(" mm\r\n");

            if ( CenterConvert(nc) < 150 ){
                Motor_Forward(2500,2500);
                TimedPause(100);
                Motor_Stop();
                return;

            }
          }

    }


void AppSequenced_Wall_Follow(void)
{

    // place wall perpendicular to wall
    // turn left & check that right sensor is around 15cm away
    // motor forward
    // after set distance 30cm, turn right & adjust distance from wall

    // after 100cm, stop only if theres obstacle

    // IR Init

    while(LaunchPad_Input()==0);  // wait for touch
    TimedPause(800);


     uint32_t raw17,raw12,raw16;
     int32_t n; uint32_t s;
     ADCflag = 0;
     s = 256; // replace with your choice
     ADC0_InitSWTriggerCh17_12_16();   // initialize channels 17,12,16
     ADC_In17_12_16(&raw17,&raw12,&raw16);  // sample
     LPF_Init(raw17,s);     // P9.0/channel 17
     LPF_Init2(raw12,s);     // P4.1/channel 12
     LPF_Init3(raw16,s);     // P9.1/channel 16
       //UART0_Init();          // initialize UART0 115,200 baud rate
      LaunchPad_Init();
     TimerA1_Init(&handlerAdcRead, 250);    // 2000 Hz sampling
     //UART0_OutString("GP2Y0A21YK0F test\nValvano Oct 2017\nConnect analog signals to P9.0,P4.1,P9.1\n");
     //EnableInterrupts();

     bool firstStart = true;
     int32_t turnCounter = 0;
     bool firstTurnLeft = false;


     while(1){
       for(n=0; n<2000; n++){
         while(ADCflag == 0){};
         ADCflag = 0; // show every 2000th point
       }
       // STARTING , ADJUST DISTANCE AND TURN LEFT
         while ( CenterConvert(nc) > 200 && firstStart)
         {

             // ADJUST DONE
             if ( CenterConvert(nc) < 130 )
             {
                 firstStart = false;
             }
             Motor_Forward(1000,1000);
             TimedPause(1000);
         }
         // IF INITIAL DIST IS TOO NEAR
         while (CenterConvert(nc) < 80 && firstStart)
         {
             firstStart = false;
             Motor_Backward(800,800);
             TimedPause(1000);

