RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
         }
         // TURN LEFT
         if (!firstTurnLeft){
         Motor_Left(1400,1400);
         TimedPause(800);
         firstTurnLeft = true;
         }



         while (turnCounter < 5){



         // MOVE FORWARD
         Motor_Forward(1500,1500);
         TimedPause(1000);

         // TURN RIGHT & ADJUST DISTANCE

         Motor_Right(1400,1400);
         TimedPause(800);
         while ( CenterConvert(nc) > 180 )
         {

              // ADJUST DONE
              if ( CenterConvert(nc) < 110 )
              {
                  break;
              }
              Motor_Forward(800,800);
              TimedPause(500);
         }
          // IF DIST IS TOO NEAR
          while (CenterConvert(nc) < 80 )
          {
              Motor_Backward(800,800);
              TimedPause(1000);

          }
         turnCounter++;
         // RETURN TO PATH AND CONTINUE
         Motor_Left(1400,1400);
         TimedPause(800);


         }                                              // end of turnCounter while loop

         while (CenterConvert(nc) > 150)
         {
             Motor_Forward(1000,1000);
             TimedPause(800);
             if( CenterConvert(nc) < 100 )
             {
                 Motor_Stop();
                 break;

             }
         } // end of continue after 100cm while loop

         LaunchPad_Output(0x04);       // B
         Clock_Delay1ms(1000);
         return;




} // end of while loop

} // end of function




void Flexible_Line_Following(void) {
    uint8_t Data;
    int32_t Position;
    int lastPosition = 0;
    int smoothedPosition = 0;
    uint8_t all_black_count = 0;
    static uint8_t behavior_counter = 0;  // Tracks which behavior to execute next

    // Proportional control constants for smooth movement
    const int Kp = 8;  // Proportional gain - adjust as needed
    const int baseSpeed = 2000;
    int leftSpeed, rightSpeed;

    AppUARTSend("Starting Flexible Line Following", SEND);

    while (1) {
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);

        // Check if all sensors detect black (end of line)
        if (Data == 0xFF) {
            all_black_count++;
            if (all_black_count > 5) { // Confirm it's not a glitch
                AppUARTSend("All black detected - Executing next behavior", SEND);
                Motor_Stop();
                Clock_Delay1ms(500);

                // Execute different behaviors based on the counter
                // You can modify these cases later according to your needs
                switch (behavior_counter % 3) {  // 3 different behaviors, you can add more
                    case 0:
                        AppUARTSend("Behavior 0: Turning right 90 degrees", SEND);
                        AppTurnRight90();  // Call existing function
                        break;
                    case 1:
                        AppUARTSend("Behavior 1: Turning left 90 degrees", SEND);
                        AppTurnLeft90();   // Call existing function
                        break;
                    case 2:
                        AppUARTSend("Behavior 2: Moving forward", SEND);
                        Motor_Forward(1500, 1500);
                        Clock_Delay1ms(1000);
                        Motor_Stop();
                        break;
                }

                behavior_counter++;  // Increment for next time
                all_black_count = 0;

                // Continue line following after behavior
                AppUARTSend("Resuming line following", SEND);
                continue;
            }
        } else {
            all_black_count = 0; // Reset counter if not all black
        }

        // Smooth line following behavior using proportional control
        // Simple moving average to smooth position readings
        smoothedPosition = (Position + lastPosition) / 2;
        lastPosition = Position;

        // Proportional control - adjust motor speeds based on position
        // The further from center, the more we turn
        int turnAdjustment = Kp * smoothedPosition / 100;  // Scale down for smoother control

        leftSpeed = baseSpeed + turnAdjustment;
        rightSpeed = baseSpeed - turnAdjustment;

        // Ensure speeds stay within valid range
        if (leftSpeed > 3000) leftSpeed = 3000;
        if (leftSpeed < 500) leftSpeed = 500;
        if (rightSpeed > 3000) rightSpeed = 3000;
        if (rightSpeed < 500) rightSpeed = 500;

        // Apply motor speeds for smooth movement
        Motor_Forward(leftSpeed, rightSpeed);

        // LED feedback
        if (Data != 0x00)
            LaunchPad_Output(0x02); // GREEN (P2.1) when line detected
        else
            LaunchPad_Output(0x01); // RED (P2.0) when no line

        Clock_Delay1ms(20); // Reduced delay for more responsive control
    }
}


// Advanced Line Following Function
// Follows black line, handles turns, detects end of line and continues
void AppAdvancedLineFollowing(void)
{
    AppUARTSend("Starting Advanced Line Following", SEND);

    uint8_t Data;
    int32_t Position;
    uint8_t all_black_count = 0;
    uint8_t search_mode = 0;

    while (1) {
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);

        // Check if all sensors detect black (end of line)
        if (Data == 0xFF) {
            all_black_count++;
            if (all_black_count > 5) { // Confirm it's not a glitch
                AppUARTSend("All black detected - End of line", SEND);

                // Take a right turn
                Motor_Stop();
                Clock_Delay1ms(500);
                AppUARTSend("Turning right", SEND);
                Motor_Right(2000, 2000);
                Clock_Delay1ms(750); // Adjust for 90-degree turn

                // Move forward a bit
                Motor_Forward(1500, 1500);
                Clock_Delay1ms(1000);

                // Enter search mode for black line
                AppUARTSend("Searching for black line", SEND);
                search_mode = 1;
                all_black_count = 0;
            }
        } else {
            all_black_count = 0; // Reset counter if not all black
        }

        if (search_mode) {
            // Search for black line by spiraling outward
            static uint8_t search_step = 0;

            if (Data != 0x00) { // Found black line again
                AppUARTSend("Black line found - Resuming follow", SEND);
                search_mode = 0;
                search_step = 0;
            } else {
                // Continue search pattern
                switch (search_step % 4) {
                    case 0: // Forward
                        Motor_Forward(1000, 1000);
                        Clock_Delay1ms(500);
                        break;
                    case 1: // Right turn
                        Motor_Right(1500, 1500);
                        Clock_Delay1ms(300);
                        break;
                    case 2: // Forward
                        Motor_Forward(1000, 1000);
                        Clock_Delay1ms(500);
                        break;
                    case 3: // Left turn
                        Motor_Left(1500, 1500);
                        Clock_Delay1ms(300);
                        break;
                }
                search_step++;

                // Prevent infinite search
                if (search_step > 20) {
                    AppUARTSend("Line not found - Stopping", SEND);
                    Motor_Stop();
                    return;
                }
            }
        } else {
            // Normal line following
            if (Position >= -47 && Position <= 47) {
                // Centered on line
                Motor_Forward(2000, 2000);
                LaunchPad_Output(0x02); // Green LED
            }
            else if (Position > 47 && Position <= 238) {
                // Need to turn right
                Motor_Forward(750, 3000);
                LaunchPad_Output(0x06); // Cyan LED
            }
            else if (Position < -47 && Position >= -238) {
                // Need to turn left
                Motor_Forward(3000, 750);
                LaunchPad_Output(0x05); // Purple LED
            }
            else if (Position > 238 || Position < -238) {
                // Sharp turn needed
                if (Position > 0) {
                    Motor_Right(2000, 2000);
                } else {
                    Motor_Left(2000, 2000);
                }
                LaunchPad_Output(0x01); // Red LED
            }
            else {
                // No line detected
                Motor_Forward(1500, 1500);
                LaunchPad_Output(0x04); // Blue LED
            }
        }

        Clock_Delay1ms(50); // Small delay
    }
}


// Bump Sensor Counter Function
// Counts how many times each bump sensor is pressed and displays the counts
void Bump_Sensor_Counter(void) {
    uint8_t bump_data;
    uint8_t prev_bump_data = 0xFF;  // All bump sensors are active-low
    uint8_t press_count[6] = {0};   // Count for each of the 6 bump sensors
    char buf[50];

