RoKenobi/SC2107-MSP432-labs/Lab5/Lab5_UARTmain.c
    AppUARTSend("Starting Bump Sensor Counter", SEND);
    AppUARTSend("Press any bump sensor to count presses", SEND);
    AppUARTSend("Press all sensors simultaneously to exit", SEND);

    while (1) {
        bump_data = Bump_Read();

        // Check each bump sensor for press/release transitions
        for (uint8_t i = 0; i < 6; i++) {
            // Check if sensor i is pressed (active-low) and was not pressed before
            if ((((bump_data >> i) & 0x01) == 0) && (((prev_bump_data >> i) & 0x01) == 1)) {
                press_count[i]++;
                sprintf(buf, "Bump %d pressed %d times", i, press_count[i]);
                AppUARTSend(buf, REPLACE);

                // Visual feedback with LED
                LaunchPad_Output(0x02); // Green LED
                Clock_Delay1ms(100);
                LaunchPad_Output(0x00); // LED off
            }
        }

        prev_bump_data = bump_data;

        // Exit condition: all bump sensors pressed simultaneously
        if ((bump_data & 0x3F) == 0x00) {
            AppUARTSend("All bump sensors pressed - Exiting", SEND);
            break;
        }

        Clock_Delay1ms(50); // Small delay to prevent excessive polling
    }

    // Display final counts
    AppUARTSend("Final Bump Sensor Press Counts:", SEND);
    for (uint8_t i = 0; i < 6; i++) {
        sprintf(buf, "Bump %d: %d presses", i, press_count[i]);
        AppUARTSend(buf, SEND);
    }
}
/*
 * This function runs a simple FSM which contain 3 states: left, right, center. The motor direction is determined by the state.
 * The motor speed is determined by the IR sensor readings; under some threshold, i.e. 20cm, it will slow down slightly,
 * if no line is detected, the function will reverse the robot back onto the line
 * the fsm state is indicated by the led color through the fp passed to fsm instance, and
 * this function terminates on bump switch collision.
 */
void AppLineFollowerTest(void)
{
    AppUARTSend("Starting FSM LINE FOLLOWER", SEND);
    isCollided = 0;

    fsm_t fsm;
    fsm.state = STATE_OK;
    fsm.fp_led = fsm_led;
    uint8_t Data;
    int32_t Position;

    while (!isCollided) {
        Data = Reflectance_Read(2000);
        Position = Reflectance_Position(Data);





        // FSM logic
        switch (fsm.state) {
        case STATE_OK:
            Motor_Forward(1500, 1500);
            if (Position > 100) fsm.state = STATE_L;
            else if (Position < -100) fsm.state = STATE_R;
            break;

        case STATE_L:
            Motor_Forward(800, 1500);
            if (Position <= 100) fsm.state = STATE_OK;
            break;

        case STATE_R:
            Motor_Forward(1500, 800);
            if (Position >= -100) fsm.state = STATE_OK;
            break;


        default:
            Motor_Stop();
            fsm.state = STATE_OK;
            break;
        }

        // LED indication for states
        fsm.fp_led(fsm.state);
        Clock_Delay1ms(30);
    }

    Motor_Stop();
    AppUARTSend("FSM LINE FOLLOWER STOPPED", SEND);
}

static void _proc_fsm(fsm_t* fsm, int32_t sig)
{

    fsm->fp_led(fsm->state);
    switch (fsm->state)
    {
        char buf[50];
#ifdef DEBUG
        sprintf(buf, "%d, %d", sig, (uint8_t)fsm->state);
#endif
        AppUARTSend(buf, SEND);
    case STATE_OK:
    {
        Motor_Forward(MOTOR_SPEED, MOTOR_SPEED);

        if (sig > 100)
        {
            fsm->state = STATE_L;
        }
        else if (sig < -100)
        {
            fsm->state = STATE_R;
        }
        break;

    }
    case STATE_L:
    {
        Motor_Forward(MOTOR_SPEED / 3, MOTOR_SPEED);
        if (sig <= 100)
        {
            fsm->state = STATE_OK;
        }
        break;

    }
    case STATE_R:
    {
        Motor_Forward(MOTOR_SPEED, MOTOR_SPEED / 3);
        if (sig >= -100)
        {
            fsm->state = STATE_OK;
        }
        break;

    }


    default:
    {
        fsm->state = STATE_ERR;
        break;
    }

    }

}

#if 0
//Sample program for using teh UART related functions.
int Program5_4(void)
{
    //int main(void){
        // demonstrates features of the EUSCIA0 driver
    char ch;
    char string[20];
    uint32_t n;
    DisableInterrupts();
    Clock_Init48MHz();// makes SMCLK=12 MHz
    EUSCIA0_Init();// initialize UART
    EnableInterrupts();
    EUSCIA0_OutString("\nLab 5 Test program for EUSCIA0 driver\n\rEUSCIA0_OutChar examples\n");
    for (ch = 'A'; ch <= 'Z'; ch = ch + 1)
    {     // print the uppercase alphabet
        EUSCIA0_OutChar(ch);
    }
    EUSCIA0_OutChar(LF);
    for (ch = 'a'; ch <= 'z'; ch = ch + 1)
    {     // print the lowercase alphabet
        EUSCIA0_OutChar(ch);
    }
    while (1)
    {
        EUSCIA0_OutString("\n\rInString: ");
        EUSCIA0_InString(string, 19); // user enters a string
        EUSCIA0_OutString(" OutString="); EUSCIA0_OutString(string); EUSCIA0_OutChar(LF);

        EUSCIA0_OutString("InUDec: "); n = EUSCIA0_InUDec();
        EUSCIA0_OutString(" OutUDec="); EUSCIA0_OutUDec(n); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString(" OutUFix1="); EUSCIA0_OutUFix1(n); EUSCIA0_OutChar(LF);
        EUSCIA0_OutString(" OutUFix2="); EUSCIA0_OutUFix2(n); EUSCIA0_OutChar(LF);

        EUSCIA0_OutString("InUHex: "); n = EUSCIA0_InUHex();
        EUSCIA0_OutString(" OutUHex="); EUSCIA0_OutUHex(n); EUSCIA0_OutChar(LF);
    }
}
#endif
